package six_lesson.HW6;

import java.util.*;

/*
 * Подумать над структурой класса Ноутбук для магазина техники - выделить поля и
 * методы. Реализовать в java.
 * Создать множество ноутбуков.
 * Написать метод, который будет запрашивать у пользователя критерий фильтрации
 * и выведет ноутбуки, отвечающие фильтру.
 * 1 - ОЗУ
 * 2 - Объем ЖД
 * 3 - Операционная система
 * 4 - Цвет
 * Далее нужно запросить минимальные значения для указанных критериев -
 * сохранить параметры фильтрации можно также в Map.
 * Отфильтровать ноутбуки их первоначального множества и вывести проходящие по
 * условиям.
 */
// public class ChoosingLaptop {
// static Set<Laptop> laptopSet = new LinkedList<>();

// public static void main(String[] args) {
// LaptopFilter laptopFilter = new LaptopFilter();
// for (int i = 0; i < 100; ++i) {
// laptopSet.add(new Laptop()); // random laptop generation
// }
// System.out.println(laptopSet.size());

// filterMenu(laptopFilter);
// }

// public static void filterMenu(LaptopFilter laptopFilter) {
// int itrm = 0;
// Scanner sc = new Scanner(System.in);

// while (item != 6) {
// System.out.println("-= Укажите номер параметра для фильтра: =- ");
// System.out.println("1 - RAM");
// System.out.println("2 - HDD Size");
// System.out.println("3 - OS Name");
// System.out.println("4 - Color");
// System.out.println("5 - Manufacturer");
// System.out.println("6 - Run Filter");
// }
// }
// }